export default function GeneralTermsAndConditionsPage() {
    return (
        <div className="container mx-auto py-10 px-5 min-h-screen">
            <h1 className="text-4xl font-bold mb-6">Общи условия</h1>
            <p className="text-lg text-gray-700 mb-4">
                Добре дошли в нашия онлайн магазин! Моля, прочетете внимателно следните общи условия, които уреждат използването на нашия уебсайт и покупките, направени чрез него.
            </p>
            <h2 className="text-2xl font-semibold mb-4">1. Общи положения</h2>
            <p className="text-lg text-gray-700 mb-4">
                Чрез използването на нашия уебсайт вие се съгласявате с тези общи условия. Ако не сте съгласни с тях, моля, не използвайте нашия сайт.
            </p>
            <h2 className="text-2xl font-semibold mb-4">2. Поръчки и плащане</h2>
            <p className="text-lg text-gray-700 mb-4">
                Всички поръчки са подчинени на наличността на продуктите. Запазваме си правото да откажем поръчка по всяко време. Плащанията се извършват чрез сигурни методи, предоставени на нашия уебсайт.
            </p>
            <h2 className="text-2xl font-semibold mb-4">3. Доставка</h2>
            <p className="text-lg text-gray-700 mb-4">
                Ние се стремим да доставим вашите поръчки в най-кратък срок. Времето за доставка може да варира в зависимост от местоположението ви и наличността на продуктите.
            </p>
            <h2 className="text-2xl font-semibold mb-4">4. Връщане и рекламации</h2>
            <p className="text-lg text-gray-700 mb-4">
                Ако не сте доволни от покупката си, моля, свържете се с нас в рамките на 14 дни от получаването на продукта, за да обсъдим възможностите за връщане или замяна.
            </p>
            <h2 className="text-2xl font-semibold mb-4">5. Защита на личните данни</h2>
            <p className="text-lg text-gray-700 mb-4">
                Ние се ангажираме да защитаваме вашите лични данни и да ги използваме само в съответствие с нашата Политика за поверителност.
            </p>
            <h2 className="text-2xl font-semibold mb-4">6. Промени в общите условия</h2>
            <p className="text-lg text-gray-700 mb-4">
                Запазваме си правото да променяме тези общи условия по всяко време. Промените ще бъдат публикувани на тази страница и ще влязат в сила незабавно след публикуването им.
            </p>
            <p className="text-lg text-gray-700">
                Благодарим ви, че избрахте нашия онлайн магазин! Ако имате въпроси относно тези общи условия, моля, свържете се с нас.
            </p>
        </div>
    )
}    